Monard2033/nRF52840-Receiver/src/main.c
static struct esb_payload esb_rx_payload;
static struct esb_config esb_config = ESB_DEFAULT_CONFIG;

static atomic_t radio_packets;
static atomic_t radio_bad_packets;
static atomic_t radio_duplicates;
static atomic_t radio_last_rssi;
static atomic_t radio_ready;
static atomic_t radio_init_error;
static atomic_t hid_queue_overruns;
static atomic_t hid_reports_sent;
static atomic_t hid_write_errors;
static bool previous_keyboard_valid;
static bool previous_consumer_valid;
static bool previous_keyboard_queue_failed;
static bool previous_consumer_queue_failed;
static uint8_t previous_keyboard[INPUT_DATA_SIZE];
static uint8_t previous_consumer[INPUT_DATA_SIZE];
static uint8_t previous_keyboard_sequence;
static uint8_t previous_consumer_sequence;

static struct k_spinlock led_state_lock;
static uint8_t windows_led_state;
static uint8_t windows_led_sequence;
static uint8_t windows_led_epoch;
static bool windows_led_valid;
static atomic_t led_ack_pending;
static atomic_t led_ack_dirty;

static struct k_spinlock trace_lock;
static struct trace_entry trace_queue[TRACE_QUEUE_DEPTH];
static uint16_t trace_head;
static uint16_t trace_tail;
static uint16_t trace_count;
static uint16_t trace_overwrites;
static bool trace_frozen;
static struct link_input_packet trace_inflight;
static bool trace_inflight_valid;

static struct k_spinlock battery_cache_lock;
static uint8_t battery_percentage;
static uint8_t battery_state;
static uint16_t battery_millivolts;
static uint8_t battery_sequence;
static uint8_t battery_flags;
static uint32_t battery_last_update_ms;
static bool battery_cache_valid;

static struct k_spinlock dfu_state_lock;
static struct link_ack_frame dfu_pending_ack;
static bool dfu_ack_active;
static uint8_t dfu_current_status = DFU_STATUS_IDLE;
static uint8_t dfu_progress_percent = 0;
static uint16_t dfu_last_offset_div_4 = 0;
static uint8_t dfu_feature_report[DFU_FEATURE_REPORT_LEN];

static void trace_record(uint8_t stage,
			 const struct link_input_packet *packet, int result)
{
	struct trace_entry entry = {
		.timestamp_ms = k_uptime_get_32(),
		.stage = stage,
		.packet_type = packet != NULL ? packet->type : 0U,
		.sequence = packet != NULL ? packet->sequence : 0U,
		.result = (int8_t)CLAMP(result, INT8_MIN, INT8_MAX),
	};

	if (packet != NULL) {
		memcpy(entry.data, packet->data, sizeof(entry.data));
	}

	k_spinlock_key_t key = k_spin_lock(&trace_lock);
	if (!trace_frozen) {
		if (trace_count == TRACE_QUEUE_DEPTH) {
			trace_tail = (uint16_t)((trace_tail + 1U) % TRACE_QUEUE_DEPTH);
			trace_count--;
			trace_overwrites++;
		}
		trace_queue[trace_head] = entry;
		trace_head = (uint16_t)((trace_head + 1U) % TRACE_QUEUE_DEPTH);
		trace_count++;
	}
	k_spin_unlock(&trace_lock, key);
}

static void trace_inflight_prepare(const struct link_input_packet *packet)
{
	k_spinlock_key_t key = k_spin_lock(&trace_lock);
	trace_inflight = *packet;
	trace_inflight_valid = true;
	k_spin_unlock(&trace_lock, key);
}

static void trace_inflight_cancel(void)
{
	k_spinlock_key_t key = k_spin_lock(&trace_lock);
	trace_inflight_valid = false;
	k_spin_unlock(&trace_lock, key);
}

static void trace_record_inflight_complete(void)
{
	struct link_input_packet packet;
	bool valid;
	k_spinlock_key_t key = k_spin_lock(&trace_lock);
	valid = trace_inflight_valid;
	if (valid) {
		packet = trace_inflight;
		trace_inflight_valid = false;
	}
	k_spin_unlock(&trace_lock, key);

	if (valid) {
		trace_record(TRACE_STAGE_HID_COMPLETE, &packet, 0);
	}
}

/*
 * The ESB event handler runs in interrupt context. It may use a message queue
 * with K_NO_WAIT, but it must not call the USB HID endpoint API directly.
 */
static bool queue_hid_report(const struct link_input_packet *packet)
{
	if (k_msgq_put(&hid_report_queue, packet, K_NO_WAIT) == 0) {
		return true;
	}

	/* The normal path has enough room for more than 100 ms of 1 kHz input.
	 * If an external USB stall lasts longer than that, discard only the oldest
	 * frame; never purge the queue because that would destroy an ordered
	 * modifier/key/release sequence such as CTRL+C. */
	struct link_input_packet discarded;

	atomic_inc(&hid_queue_overruns);
	trace_record(TRACE_STAGE_HID_QUEUE_OVERFLOW, packet, -ENOSPC);
	if (k_msgq_get(&hid_report_queue, &discarded, K_NO_WAIT) == 0) {
		return k_msgq_put(&hid_report_queue, packet, K_NO_WAIT) == 0;
	}
	return false;
}

static bool sequence_is_newer(uint8_t sequence, uint8_t previous)
{
	return (int8_t)(sequence - previous) > 0;
}

static bool battery_packet_is_valid(const struct link_input_packet *packet)
{
	uint16_t const millivolts = (uint16_t)packet->data[2] |
		((uint16_t)packet->data[3] << 8);

	return packet->data[0] <= 100U && packet->data[1] <= 4U &&
	       millivolts >= BATTERY_VALID_MIN_MV &&
	       millivolts <= BATTERY_VALID_MAX_MV &&
	       (packet->data[5] & 0x01U) != 0U &&
	       (packet->data[5] & 0xF0U) == 0U &&
	       packet->data[6] == 0U && packet->data[7] == 0U;
}

static void battery_cache_update(const struct link_input_packet *packet)
{
	k_spinlock_key_t key = k_spin_lock(&battery_cache_lock);
	bool const newer = !battery_cache_valid ||
		sequence_is_newer(packet->data[4], battery_sequence);

	if (newer) {
		battery_percentage = packet->data[0];
		battery_state = packet->data[1];
		battery_millivolts = (uint16_t)packet->data[2] |
			((uint16_t)packet->data[3] << 8);
		battery_sequence = packet->data[4];
		battery_flags = packet->data[5];
		battery_last_update_ms = k_uptime_get_32();
		battery_cache_valid = true;
	}
	k_spin_unlock(&battery_cache_lock, key);
}

static void receiver_set_led_state(uint8_t led_state)
{
	led_state &= 0x07U;
	k_spinlock_key_t key = k_spin_lock(&led_state_lock);
	bool const changed = !windows_led_valid ||
		windows_led_state != led_state;

	if (changed) {
		windows_led_state = led_state;
		windows_led_sequence++;
	}
	windows_led_valid = true;
	k_spin_unlock(&led_state_lock, key);

	if (changed) {
		atomic_set(&led_ack_dirty, 1);
		atomic_set(&led_ack_pending, 1);
	}
}

static bool receiver_queue_led_ack(void)
{
	struct link_ack_frame ack = {
		.magic = LINK_ACK_MAGIC,
		.version = LINK_VERSION,
		.type = LINK_ACK_TYPE_LOCK_STATE,
	};
	struct esb_payload payload = { 0 };

	k_spinlock_key_t dfu_key = k_spin_lock(&dfu_state_lock);
	if (dfu_ack_active) {
		ack = dfu_pending_ack;
		dfu_ack_active = false;
		k_spin_unlock(&dfu_state_lock, dfu_key);
	} else {
		k_spin_unlock(&dfu_state_lock, dfu_key);
		atomic_set(&led_ack_dirty, 0);
		k_spinlock_key_t key = k_spin_lock(&led_state_lock);
		ack.sequence = windows_led_sequence;
		ack.data[0] = windows_led_state;
		ack.data[1] = windows_led_valid ? 0x01U : 0x00U;
		ack.data[2] = windows_led_epoch;
		k_spin_unlock(&led_state_lock, key);
	}

	payload.length = sizeof(ack);
	payload.pipe = 0;
	payload.noack = false;
	memcpy(payload.data, &ack, sizeof(ack));
	bool const queued = esb_write_payload(&payload) == 0;
	if (!queued) {
		/* No immediate retry: retain dirty state and wait for the next RX
		 * event, avoiding a tight loop on the three-entry ACK FIFO. */
		atomic_set(&led_ack_dirty, 1);
	}
	return queued;
}

static void receiver_ack_task(void)
{
	if (atomic_cas(&led_ack_pending, 1, 0)) {
		(void)receiver_queue_led_ack();
	}
}

static void receiver_esb_event_handler(const struct esb_evt *event)
{
	if (event->evt_id != ESB_EVENT_RX_RECEIVED) {
		return;
	}

	while (esb_read_rx_payload(&esb_rx_payload) == 0) {
		struct link_input_packet packet;

		atomic_inc(&radio_packets);
		atomic_set(&radio_last_rssi, esb_rx_payload.rssi);
		if (esb_rx_payload.length != sizeof(packet)) {
			atomic_inc(&radio_bad_packets);
			continue;
		}

		memcpy(&packet, esb_rx_payload.data, sizeof(packet));

