Monard2033/nRF52840-Receiver/src/main.c
		if (packet.magic != LINK_MAGIC || packet.version != LINK_VERSION) {
			atomic_inc(&radio_bad_packets);
			continue;
		}

		if (atomic_get(&led_ack_dirty) != 0) {
			atomic_set(&led_ack_pending, 1);
		}

		if (packet.type == LINK_TYPE_DFU_STATUS) {
			k_spinlock_key_t key = k_spin_lock(&dfu_state_lock);
			dfu_current_status = packet.data[0];
			dfu_progress_percent = packet.data[1];
			dfu_last_offset_div_4 = (uint16_t)packet.data[2] |
				((uint16_t)packet.data[3] << 8);
			k_spin_unlock(&dfu_state_lock, key);
			atomic_set(&led_ack_pending, 1);
			continue;
		}

		if (packet.type == LINK_TYPE_BATTERY) {
			if (!battery_packet_is_valid(&packet)) {
				atomic_inc(&radio_bad_packets);
				continue;
			}
			battery_cache_update(&packet);
			continue;
		}

		if (packet.type == LINK_TYPE_CONTROL) {
			if (packet.data[0] != LINK_CONTROL_POLL_ACK) {
				atomic_inc(&radio_bad_packets);
				continue;
			}
			continue;
		}

		trace_record(TRACE_STAGE_ESB_RX, &packet, 0);

		bool *previous_valid = packet.type == LINK_TYPE_KEYBOARD ?
			&previous_keyboard_valid : &previous_consumer_valid;
		bool *previous_queue_failed = packet.type == LINK_TYPE_KEYBOARD ?
			&previous_keyboard_queue_failed : &previous_consumer_queue_failed;
		uint8_t *previous_data = packet.type == LINK_TYPE_KEYBOARD ?
			previous_keyboard : previous_consumer;
		uint8_t *previous_sequence = packet.type == LINK_TYPE_KEYBOARD ?
			&previous_keyboard_sequence : &previous_consumer_sequence;
		bool const sequence_newer = !*previous_valid ||
			sequence_is_newer(packet.sequence, *previous_sequence);
		bool const same_sequence_retry = *previous_valid &&
			packet.sequence == *previous_sequence && *previous_queue_failed;

		/*
		 * Keyboard packets are absolute states: if the data is identical to
		 * the current keyboard state, it is a keepalive/duplicate, so drop it
		 * and do NOT re-queue it to Windows.
		 */
		if (*previous_valid && !same_sequence_retry &&
		    packet.type == LINK_TYPE_KEYBOARD &&
		    memcmp(packet.data, previous_data, INPUT_DATA_SIZE) == 0) {
			*previous_sequence = packet.sequence;
			*previous_queue_failed = false;
			atomic_inc(&radio_duplicates);
			trace_record(TRACE_STAGE_DUPLICATE_DROP, &packet, 0);
			continue;
		}

		if (*previous_valid && !sequence_newer && !same_sequence_retry) {
			atomic_inc(&radio_duplicates);
			trace_record(TRACE_STAGE_SEQUENCE_DROP, &packet, 0);
			continue;
		}

		if (queue_hid_report(&packet)) {
			trace_record(TRACE_STAGE_HID_QUEUED, &packet, 0);
			*previous_valid = true;
			*previous_sequence = packet.sequence;
			*previous_queue_failed = false;
			memcpy(previous_data, packet.data, INPUT_DATA_SIZE);
		} else {
			*previous_valid = true;
			*previous_sequence = packet.sequence;
			*previous_queue_failed = true;
		}
	}
}

static int esb_initialize(void)
{
	static const uint8_t base_address_0[4] = {
		0xE7, 0xE7, 0xE7, 0xE7
	};
	static const uint8_t base_address_1[4] = {
		0xC2, 0xC2, 0xC2, 0xC2
	};
	static const uint8_t address_prefixes[8] = {
		0xE7, 0xC2, 0xC3, 0xC4, 0xC5, 0xC6, 0xC7, 0xC8
	};
	int err;

	esb_config.protocol = ESB_PROTOCOL_ESB_DPL;
	esb_config.mode = ESB_MODE_PRX;
	esb_config.bitrate = ESB_BITRATE_2MBPS;
	esb_config.tx_output_power = ESB_TX_POWER_8DBM;
	esb_config.payload_length = sizeof(struct link_input_packet);
	esb_config.selective_auto_ack = true;
	esb_config.use_fast_ramp_up = true;
	esb_config.event_handler = receiver_esb_event_handler;

	err = esb_init(&esb_config);
	if (err != 0) {
		return err;
	}

	err = esb_set_base_address_0(base_address_0);
	if (err != 0) {
		return err;
	}

	err = esb_set_base_address_1(base_address_1);
	if (err != 0) {
		return err;
	}

	err = esb_set_prefixes(address_prefixes, ARRAY_SIZE(address_prefixes));
	if (err != 0) {
		return err;
	}

	err = esb_set_rf_channel(LINK_RF_CHANNEL);
	if (err != 0) {
		return err;
	}

	return esb_start_rx();
}

static uint8_t hid_tx_buffer[1U + INPUT_DATA_SIZE];
static uint8_t battery_feature_report[HID_FEATURE_REPORT_LEN];
static uint8_t trace_feature_report[TRACE_FEATURE_REPORT_LEN];

static void battery_feature_build(uint8_t report[HID_FEATURE_REPORT_LEN])
{
	uint8_t *const payload = &report[1];
	k_spinlock_key_t key = k_spin_lock(&battery_cache_lock);
	uint32_t const age_ms = battery_cache_valid ?
		(k_uptime_get_32() - battery_last_update_ms) : UINT32_MAX;
	uint32_t const age_seconds = age_ms == UINT32_MAX ? 0xFFFFU :
		MIN(age_ms / 1000U, 0xFFFFU);

	report[0] = HID_REPORT_ID_BATTERY;
	payload[0] = battery_percentage;
	payload[1] = battery_state;
	payload[2] = (uint8_t)battery_millivolts;
	payload[3] = (uint8_t)(battery_millivolts >> 8);
	payload[4] = battery_sequence;
	payload[5] = battery_cache_valid ? battery_flags : 0U;
	payload[6] = (uint8_t)age_seconds;
	payload[7] = (uint8_t)(age_seconds >> 8);
	k_spin_unlock(&battery_cache_lock, key);
}

static void trace_feature_build(uint8_t report[TRACE_FEATURE_REPORT_LEN])
{
	struct trace_entry entry = { 0 };
	bool valid = false;
	uint8_t remaining;
	uint8_t overwrites;
	bool frozen;
	k_spinlock_key_t key = k_spin_lock(&trace_lock);

	if (trace_count != 0U) {
		entry = trace_queue[trace_tail];
		trace_tail = (uint16_t)((trace_tail + 1U) % TRACE_QUEUE_DEPTH);
		trace_count--;
		valid = true;
	}
	remaining = (uint8_t)MIN(trace_count, UINT8_MAX);
	overwrites = (uint8_t)MIN(trace_overwrites, UINT8_MAX);
	frozen = trace_frozen;
	k_spin_unlock(&trace_lock, key);

	memset(report, 0, TRACE_FEATURE_REPORT_LEN);
	report[0] = HID_REPORT_ID_TRACE;
	report[1] = 1U; /* Trace protocol version. */
	report[2] = (valid ? 0x01U : 0U) | (frozen ? 0x02U : 0U);
	report[3] = remaining;
	report[4] = overwrites;
	if (valid) {
		memcpy(&report[5], &entry, sizeof(entry));
	}
}

static int hid_get_report(const struct device *dev,
				  struct usb_setup_packet *setup,
				  int32_t *len, uint8_t **data)
{
	ARG_UNUSED(dev);

	uint8_t const report_type = setup->wValue >> 8;
	uint8_t const report_id = setup->wValue & 0xFFU;

	if (report_type == 3U && report_id == HID_REPORT_ID_BATTERY) {
		battery_feature_build(battery_feature_report);
		*data = battery_feature_report;
		*len = sizeof(battery_feature_report);
		return 0;
	}

	if (report_type == 3U && report_id == HID_REPORT_ID_DFU) {
		k_spinlock_key_t key = k_spin_lock(&dfu_state_lock);
		dfu_feature_report[0] = HID_REPORT_ID_DFU;
		dfu_feature_report[1] = dfu_current_status;
		dfu_feature_report[2] = dfu_progress_percent;
		dfu_feature_report[3] = (uint8_t)dfu_last_offset_div_4;
		dfu_feature_report[4] = (uint8_t)(dfu_last_offset_div_4 >> 8);
		dfu_feature_report[5] = 0;
		dfu_feature_report[6] = 0;
		dfu_feature_report[7] = 0;
		dfu_feature_report[8] = 0;
		k_spin_unlock(&dfu_state_lock, key);
		*data = dfu_feature_report;
		*len = sizeof(dfu_feature_report);
		return 0;
	}

	if (report_type == 3U && report_id == HID_REPORT_ID_TRACE) {
		trace_feature_build(trace_feature_report);
		*data = trace_feature_report;
		*len = sizeof(trace_feature_report);
		return 0;
	}

	return -ENOTSUP;
}

static int hid_set_report(const struct device *dev,
				  struct usb_setup_packet *setup,
				  int32_t *len, uint8_t **data)
{
	ARG_UNUSED(dev);

