Monard2033/nRF52840-Receiver/src/main.c
	/*
	 * Enumerate USB first. A radio initialization failure must never make
	 * the HID device disappear from the host.
	 */
	err = usb_hid_initialize();
	if (err != 0) {
		LOG_ERR("USB HID initialization failed: %d", err);
		return err;
	}

	err = esb_initialize();
	if (err != 0) {
		atomic_set(&radio_init_error, err);
		LOG_ERR("ESB initialization failed: %d; USB remains available", err);
	} else {
		atomic_set(&radio_ready, 1);
		LOG_INF("Ready: ESB PRX 2 Mbps channel %u, pipe 0 address "
			"E7:E7E7E7E7, USB keyboard + Consumer Control",
			LINK_RF_CHANNEL);
	}

	for (;;) {
		struct link_input_packet queued;
		receiver_ack_task();

		if (!usb_hid_ready()) {
			/*
			 * Retain only keyboard state while the PC is absent. Consumer
			 * actions are transitions and must not be replayed later.
			 */
			while (k_msgq_get(&hid_report_queue, &queued,
					  K_NO_WAIT) == 0) {
				trace_record(TRACE_STAGE_USB_NOT_READY_DROP, &queued,
					     -ENOTCONN);
			}
			hid_pending_valid = false;
			hid_pending_failure_logged = false;
			k_msleep(1);
			continue;
		}

		if (!hid_pending_valid &&
		    k_msgq_get(&hid_report_queue, &queued, K_NO_WAIT) == 0) {
			hid_pending = queued;
			hid_pending_valid = true;
			hid_pending_failure_logged = false;
		}

		if (hid_pending_valid) {
			int const send_result = hid_pending.type == LINK_TYPE_KEYBOARD ?
				send_keyboard_report(&hid_pending) :
				send_consumer_report(&hid_pending);

			if (send_result == 0) {
				hid_pending_valid = false;
				hid_pending_failure_logged = false;
			} else if (!hid_pending_failure_logged) {
				trace_record(send_result == -EBUSY ?
					TRACE_STAGE_HID_SUBMIT_BUSY :
					TRACE_STAGE_HID_SUBMIT_ERROR,
					&hid_pending, send_result);
				hid_pending_failure_logged = true;
			}
		}

		/* No blocking HID wait: let the 1 ms USB endpoint callback release the
		 * idle semaphore while the radio handler remains free to queue input. */
		k_yield();
	}
}
